```
terraform apply -var-file=variables.json
data.huaweicloud_availability_zones.this: Reading...
data.huaweicloud_availability_zones.this: Read complete after 0s [id=74326821]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.evs_postpaid_volume.huaweicloud_evs_volume.this[0] will be created
  + resource "huaweicloud_evs_volume" "this" {
      + attachment             = (known after apply)
      + availability_zone      = "cn-north-4a"
      + cascade                = false
      + charging_mode          = (known after apply)
      + dedicated_storage_name = (known after apply)
      + description            = "test description"
      + device_type            = "VBD"
      + enterprise_project_id  = (known after apply)
      + id                     = (known after apply)
      + iops                   = 3000
      + multiattach            = false
      + name                   = "test-volume-name"
      + region                 = (known after apply)
      + size                   = 20
      + status                 = (known after apply)
      + tags                   = {
          + "foo" = "bar"
          + "key" = "value"
        }
      + throughput             = 125
      + volume_type            = "GPSSD2"
      + wwn                    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + volume_status    = (known after apply)
  + volume_volume_id = (known after apply)
  + volume_wwn       = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.evs_postpaid_volume.huaweicloud_evs_volume.this[0]: Creating...
module.evs_postpaid_volume.huaweicloud_evs_volume.this[0]: Still creating... [10s elapsed]
module.evs_postpaid_volume.huaweicloud_evs_volume.this[0]: Still creating... [20s elapsed]
module.evs_postpaid_volume.huaweicloud_evs_volume.this[0]: Creation complete after 25s [id=34e82156-9192-4ca1-8d6c-407cb9b0043d]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

volume_status = "available"
volume_volume_id = "34e82156-9192-4ca1-8d6c-407cb9b0043d"
volume_wwn = "68886031196324401000000002041b3a"
```

```
terraform destroy -var-file=variables.json
data.huaweicloud_availability_zones.this: Reading...
data.huaweicloud_availability_zones.this: Read complete after 0s [id=74326821]
module.evs_postpaid_volume.huaweicloud_evs_volume.this[0]: Refreshing state... [id=34e82156-9192-4ca1-8d6c-407cb9b0043d]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # module.evs_postpaid_volume.huaweicloud_evs_volume.this[0] will be destroyed
  - resource "huaweicloud_evs_volume" "this" {
      - attachment             = [] -> null
      - availability_zone      = "cn-north-4a" -> null
      - cascade                = false -> null
      - description            = "test description" -> null
      - device_type            = "VBD" -> null
      - enterprise_project_id  = "0" -> null
      - id                     = "34e82156-9192-4ca1-8d6c-407cb9b0043d" -> null
      - iops                   = 3000 -> null
      - multiattach            = false -> null
      - name                   = "test-volume-name" -> null
      - region                 = "cn-north-4" -> null
      - size                   = 20 -> null
      - status                 = "available" -> null
      - tags                   = {
          - "foo" = "bar"
          - "key" = "value"
        } -> null
      - throughput             = 125 -> null
      - volume_type            = "GPSSD2" -> null
      - wwn                    = "68886031196324401000000002041b3a" -> null
        # (3 unchanged attributes hidden)
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - volume_status    = "available" -> null
  - volume_volume_id = "34e82156-9192-4ca1-8d6c-407cb9b0043d" -> null
  - volume_wwn       = "68886031196324401000000002041b3a" -> null

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

module.evs_postpaid_volume.huaweicloud_evs_volume.this[0]: Destroying... [id=34e82156-9192-4ca1-8d6c-407cb9b0043d]
module.evs_postpaid_volume.huaweicloud_evs_volume.this[0]: Still destroying... [id=34e82156-9192-4ca1-8d6c-407cb9b0043d, 10s elapsed]
module.evs_postpaid_volume.huaweicloud_evs_volume.this[0]: Destruction complete after 11s

Destroy complete! Resources: 1 destroyed.
```
